Written By: Dr Muhammad Asif Assistant\
Email: asifbwp78654@gmail.com\
Date:26-01-23

In [1]:
import pandas as pd
import numpy as np  
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [2]:
dates = pd.date_range("20230201", periods=6)
dates

DatetimeIndex(['2023-02-01', '2023-02-02', '2023-02-03', '2023-02-04',
               '2023-02-05', '2023-02-06'],
              dtype='datetime64[ns]', freq='D')

In [3]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2023-02-01 -0.450895  1.532949  1.203018 -0.301087
2023-02-02 -0.724158 -0.545712 -1.864999 -1.211168
2023-02-03  1.863831 -1.466131 -1.638721 -2.461539
2023-02-04  0.304314 -0.034921  0.548512 -0.408799
2023-02-05  0.375676 -0.937333 -0.727781 -0.924502
2023-02-06 -0.733850 -1.432433  0.339134 -0.756724

In [4]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20230102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2023-01-02  1.0  3   test  foo
1  1.0 2023-01-02  1.0  3  train  foo
2  1.0 2023-01-02  1.0  3   test  foo
3  1.0 2023-01-02  1.0  3  train  foo

In [5]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [6]:
df.index

DatetimeIndex(['2023-02-01', '2023-02-02', '2023-02-03', '2023-02-04',
               '2023-02-05', '2023-02-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [8]:
df.to_numpy()

array([[-0.45089508,  1.53294907,  1.2030181 , -0.30108738],
       [-0.72415771, -0.54571175, -1.86499889, -1.21116781],
       [ 1.86383117, -1.46613068, -1.63872123, -2.46153877],
       [ 0.30431418, -0.03492149,  0.54851185, -0.40879923],
       [ 0.37567578, -0.9373327 , -0.72778115, -0.92450195],
       [-0.73384955, -1.43243311,  0.33913393, -0.75672444]])

In [9]:
df2.to_numpy()

array([[1.0, Timestamp('2023-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2023-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2023-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2023-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [10]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2023-02-01 -0.301087  1.203018  1.532949 -0.450895
2023-02-02 -1.211168 -1.864999 -0.545712 -0.724158
2023-02-03 -2.461539 -1.638721 -1.466131  1.863831
2023-02-04 -0.408799  0.548512 -0.034921  0.304314
2023-02-05 -0.924502 -0.727781 -0.937333  0.375676
2023-02-06 -0.756724  0.339134 -1.432433 -0.733850

In [11]:
df.sort_values(by="B")

                   A         B         C         D
2023-02-03  1.863831 -1.466131 -1.638721 -2.461539
2023-02-06 -0.733850 -1.432433  0.339134 -0.756724
2023-02-05  0.375676 -0.937333 -0.727781 -0.924502
2023-02-02 -0.724158 -0.545712 -1.864999 -1.211168
2023-02-04  0.304314 -0.034921  0.548512 -0.408799
2023-02-01 -0.450895  1.532949  1.203018 -0.301087

In [31]:
df.iloc[0:2,0:3]

                   A         B         C
2023-02-01 -0.450895  1.532949  1.203018
2023-02-02 -0.724158 -0.545712 -1.864999

In [30]:
df.loc[:,["A","B"]]

                   A         B
2023-02-01 -0.450895  1.532949
2023-02-02 -0.724158 -0.545712
2023-02-03  1.863831 -1.466131
2023-02-04  0.304314 -0.034921
2023-02-05  0.375676 -0.937333
2023-02-06 -0.733850 -1.432433

In [12]:
df["A"]

2023-02-01   -0.450895
2023-02-02   -0.724158
2023-02-03    1.863831
2023-02-04    0.304314
2023-02-05    0.375676
2023-02-06   -0.733850
Freq: D, Name: A, dtype: float64

In [13]:
df[0:3]

                   A         B         C         D
2023-02-01 -0.450895  1.532949  1.203018 -0.301087
2023-02-02 -0.724158 -0.545712 -1.864999 -1.211168
2023-02-03  1.863831 -1.466131 -1.638721 -2.461539

In [14]:
df["20230102":"20230104"]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [15]:
df.loc[dates[0]]

A   -0.450895
B    1.532949
C    1.203018
D   -0.301087
Name: 2023-02-01 00:00:00, dtype: float64

In [16]:
df.loc[:, ["A", "B"]]

                   A         B
2023-02-01 -0.450895  1.532949
2023-02-02 -0.724158 -0.545712
2023-02-03  1.863831 -1.466131
2023-02-04  0.304314 -0.034921
2023-02-05  0.375676 -0.937333
2023-02-06 -0.733850 -1.432433

In [29]:
df.loc["20230102" : "20230104", ["A", "B"]]

Empty DataFrame
Columns: [A, B]
Index: []

In [26]:
df.loc["20230102", ["A", "B"]]

KeyError: '20230102'

In [ ]:
df.loc[dates[0], "A"]

In [ ]:
df.at[dates[0], "A"]

In [ ]:
df.iloc[3]

In [ ]:
df.iloc[3:5, 0:2]

In [ ]:
df.iloc[[1, 2, 4], [0, 2]]

In [ ]:
df.iloc[1:3, :]

In [ ]:
df.iloc[:, 1:3]

In [ ]:
df.iloc[1, 1]

In [ ]:
df.iat[1, 1]

In [ ]:
df[df["A"] > 0]

In [ ]:
df[df > 0]

In [ ]:
df2 = df.copy()

In [ ]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [ ]:
df.at[dates[0], "A"] = 0

In [ ]:
df.iat[0, 1] = 0

In [ ]:
df.loc[:, "D"] = np.array([5] * len(df))

In [ ]:
df

In [ ]:
df2 = df.copy()

In [ ]:
df2[df2 > 0] = -df2
df2

In [ ]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

In [ ]:
df1.dropna(how="any")

In [ ]:
df1.fillna(value=5)

In [ ]:
pd.isna(df1)

In [ ]:
df.mean()

In [ ]:
df.mean(1)

In [ ]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

In [ ]:
df.sub(s, axis="index")

In [ ]:
df.apply(np.cumsum)

In [ ]:
df.apply(lambda x: x.max() - x.min())

In [ ]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

In [ ]:
s.value_counts()

In [ ]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4))
df

In [ ]:
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

In [ ]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
left

In [ ]:
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
right

In [ ]:
pd.merge(left, right, on="key")

In [ ]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
left

In [ ]:
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})
right

In [ ]:
pd.merge(left, right, on="key")

In [ ]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df

In [ ]:
df.groupby("A")[["C", "D"]].sum()

In [ ]:
df.groupby(["A", "B"]).sum()

In [ ]:
tuples = list(
    zip(
        ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
        ["one", "two", "one", "two", "one", "two", "one", "two"],
    )
)

index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])

df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])

df2 = df[:4]

df2

In [ ]:
stacked = df2.stack()
stacked

In [ ]:
stacked.unstack()

In [ ]:
stacked.unstack(1)

In [ ]:
stacked.unstack(0)

In [ ]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)

df

In [ ]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

In [ ]:
rng = pd.date_range("1/1/2012", periods=100, freq="S")

ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample("5Min").sum()

In [ ]:
rng = pd.date_range("3/6/2012 00:00", periods=5, freq="D")

ts = pd.Series(np.random.randn(len(rng)), rng)

ts

In [ ]:
ts_utc = ts.tz_localize("UTC")

ts_utc

In [ ]:
ts_utc.tz_convert("US/Eastern")

In [ ]:
rng = pd.date_range("1/1/2012", periods=5, freq="M")

ts = pd.Series(np.random.randn(len(rng)), index=rng)

ts

In [ ]:
ps = ts.to_period()

ps

In [ ]:
ps.to_timestamp()

In [ ]:
prng = pd.period_range("1990Q1", "2000Q4", freq="Q-NOV")

ts = pd.Series(np.random.randn(len(prng)), prng)

ts.index = (prng.asfreq("M", "e") + 1).asfreq("H", "s") + 9

ts.head()

In [ ]:
df = pd.DataFrame(
    {"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "a", "a", "e"]}
)

In [ ]:
df["grade"] = df["raw_grade"].astype("category")

df["grade"]

In [ ]:
new_categories = ["very good", "good", "very bad"]

df["grade"] = df["grade"].cat.rename_categories(new_categories)
df

In [ ]:
df["grade"] = df["grade"].cat.set_categories(
    ["very bad", "bad", "medium", "good", "very good"]
)


df["grade"]

In [ ]:
df.sort_values(by="grade")

In [ ]:
df.groupby("grade").size()

In [ ]:
import matplotlib.pyplot as plt

plt.close("all")

In [ ]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range("1/1/2000", periods=1000))

ts = ts.cumsum()

ts.plot();

In [ ]:
plt.show()

In [ ]:
df = pd.DataFrame(
    np.random.randn(1000, 4), index=ts.index, columns=["A", "B", "C", "D"]
)
df

In [ ]:
df = pd.DataFrame(
    np.random.randn(1000, 4), index=ts.index, columns=["A", "B", "C", "D"]
)

df = df.cumsum()

plt.figure();

df.plot();

plt.legend(loc='best');

In [ ]:
df.to_csv("foo.csv")

In [ ]:
pd.read_csv("foo.csv")

In [ ]:
import matplotlib.pyplot as plt
# df.to_hdf("foo.h5", "df")

In [ ]:
df.to_excel("foo.xlsx", sheet_name="Sheet1")
df

In [ ]:
pd.read_excel("foo.xlsx", "Sheet1", index_col=None, na_values=["NA"])

In [ ]:
if pd.Series([False, True, False]):
     print("I was true")

In [32]:
import seaborn as sns
kashti = sns.load_dataset("titanic")
kashti

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

# Sampling

In [33]:
kashti.sample(100)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
344,0,2,male,36.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
413,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
612,1,3,female,NaN,1,0,15.5000,Q,Third,woman,False,NaN,Queenstown,yes,False
666,0,2,male,25.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
669,1,1,female,NaN,1,0,52.0000,S,First,woman,False,C,Southampton,yes,False
472,1,2,female,33.0,1,2,27.7500,S,Second,woman,False,NaN,Southampton,yes,False
467,0,1,male,56.0,0,0,26.5500,S,First,man,True,NaN,Southampton,no,True
856,1,1,female,45.0,1,1,164.8667,S,First,woman,False,NaN,Southampton,yes,False
100,0,3,female,28.0,0,0,7.8958,S,Third,woman,False,NaN,Southampton,no,True

## Bolean Indexing

##### Filtering using conditional

In [37]:
kashti[kashti["fare"]< 5]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
179,0,3,male,36.0,0,0,0.0000,S,Third,man,True,NaN,Southampton,no,True
263,0,1,male,40.0,0,0,0.0000,S,First,man,True,B,Southampton,no,True
271,1,3,male,25.0,0,0,0.0000,S,Third,man,True,NaN,Southampton,yes,True
277,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
302,0,3,male,19.0,0,0,0.0000,S,Third,man,True,NaN,Southampton,no,True
378,0,3,male,20.0,0,0,4.0125,C,Third,man,True,NaN,Cherbourg,no,True
413,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
466,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
481,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
597,0,3,male,49.0,0,0,0.0000,S,Third,man,True,NaN,Southampton,no,True
633,0,1,male,NaN,0,0,0.0000,S,First,man,True,NaN,Southampton,no,True
674,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
732,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
806,0,1,male,39.0,0,0,0.0000,S,First,man,True,A,Southampton,no,True
815,0,1,male,NaN,0,0,0.0000,S,First,man,True,B,Southampton,no,True
822,0,1,male,38.0,0,0,0.0000,S,First,man,True,NaN,Southampton,no,True